brew 'awscli'
brew 'awscurl'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'btop'
brew 'entr'
brew 'fd'
brew 'ffmpeg'
brew 'ghc'
brew 'git'
brew 'git-absorb'
brew 'gnupg'
brew 'htop'
brew 'jq'
brew 'lolcat'
brew 'lua-language-server'
brew 'mise'
brew 'mtr'
brew 'ncdu'
brew 'nmap'
brew 'pandoc'
brew 'parallel'
brew 'pass'
brew 'pigz'
brew 'pv'
brew 'pyright'
brew 'ripgrep'
brew 'rsync'
brew 'ruby'
brew 'shellcheck'
brew 'sl'
brew 'sl'
brew 'task'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tig'
brew 'timewarrior'
brew 'tmux'
brew 'toilet'
brew 'tree'
brew 'vim' if OS.linux?
brew 'wget'
brew 'xsv'
brew 'zsh'

if OS.mac?
  brew 'coreutils'
  brew 'gnu-sed'
  brew 'pinentry-mac'
  brew 'terminal-notifier'
  cask 'alfred'
  cask 'basictex'
  cask 'bettertouchtool'
  cask 'cscreen'
  cask 'discord'
  cask 'font-dejavu-sans-mono-nerd-font'
  cask 'font-roboto-mono-nerd-font'
  cask 'hammerspoon'
  cask 'iterm2'
  cask 'macvim'
  cask 'obs'
  cask 'signal'
end
